# 1. Считываем n и m из одной строки
# input().split() разбивает строку "10 3" на список ["10", "3"]
# map(int, ...) превращает их в числа
n, m = map(int, input().split())

# 2. Считываем саму строку лекции
text = input()

# 3. Создаем множество (set) для хранения УНИКАЛЬНЫХ слов
unique_words = set()

# 4. Проходимся циклом (как в прошлой задаче про cyclic shift)
# Нам нужно идти от 0 до (n - m + 1), чтобы "окно" не вылезло за край
# n=10, m=3
for i in range(n - m + 1): # 10-3+1=8 for i in range(8)=0,1,2,3,4,5,6,7
    # Вырезаем подстроку длиной m
    word = text[i: i + m]

    # Добавляем в множество (дубликаты сами исчезнут)
    unique_words.add(word)

# 5. Выводим количество уникальных слов (размер множества)
print(len(unique_words))
